Repository: fechad/PolyScrabble-Multiplatform-Project-LOG3900
Catalog: client_leger/lib/l10n/app_*.arb
Languages: fr

# language
source: English
fr: French

# mainTitle
source: Game Mode
fr: Mode de jeu

# mainButtonClassic
source: Classic Scrabble
fr: Scrabble Classique

# mainButtonTheme
source: Themed Scrabble
fr: Scrabble à Thème

# classicButtonSoloGame
source: Play a solo game
fr: Jouer une partie en solo

# classicButtonMultiGame
source: Create a multiplayer game
fr: Créer une partie multijoueur

# classicButtonJoin
source: Join a multiplayer game
fr: Joindre une partie multijoueur

# classicButtonObserve
source: Observe a multiplayer game
fr: Observer une partie multijoueur

# classicCreateSoloTitle
source: Solo Game
fr: Partie Solo

# classicCreateSoloVpName
source: Virtual player name
fr: Nom du joueur virtuel

# classicCreateSoloVpDifficultyLabel
source: Virtual player difficulty
fr: Difficulté des joueurs virtuels

# classicCreateSoloVpLanguageLabel
source: Virtual player language
fr: Langue du joueur virtuel

# classicCreateSoloVpDifficultyOne
source: Beginner
fr: Débutant

# classicCreateSoloVpDifficultyThree
source: Adaptable
fr: Adaptatif

# classicCreateSoloTime
source: Time per turn
fr: Temps par tour

# classicCreateMultiTitle
source: Multiplayer Game
fr: Partie Multijoueur

# classicCreateMultiVpDifficultyLabel
source: Virtual players difficulty
fr: Difficulté des joueurs virtuels

# classicCreateMultiVpLanguageLabel
source: Virtual players language
fr: Langue des joueurs virtuels

# classicCreateMultiVpDifficultyOne
source: Beginner
fr: Débutant

# classicCreateMultiVpDifficultyThree
source: Adaptable
fr: Adaptatif

# classicCreateMultiTime
source: Time per turn
fr: Temps par tour

# classicCreateMultiGameTypeLabel
source: Game type
fr: Type de parties

# classicCreateMultiGameTypeOne
source: Private
fr: Privée

# classicCreateMultiGameTypeTwo
source: Public
fr: Publique

# classicCreateMultiGameTypeThree
source: Public with password
fr: Publique avec mot de passe

# classicJoinMultiTitle
source: Available Games
fr: Parties Disponibles

# classicJoinMultiButton
source: Join
fr: Joindre

# classicJoinMultiButtonLock
source: Join [KEY]
fr: Joindre [CLÉ]

# classicJoinMultiPopupTitle
source: Private game
fr: Partie privée

# classicJoinMultiPopupBody
source: Enter the password to join the lobby.
fr: Veuillez entrer le mot de passe pour joindre la partie.

# classicJoinMultiPopupInput
source: Type the password
fr: Entrer le mot de passe

# classicObserveMultiTitle
source: Observable Games
fr: Parties Observables

# themeTitle
source: Themed virtual players
fr: Joueurs virtuel à thème

# chatBarGeneral
source: General Chat
fr: Canal général

# generalPageButton
source: New window
fr: Nouvelle fenêtre

# generalPagePlaceholder
source: Type a message
fr: Entrer un message

# otherChatPagePlaceHolderJoin
source: Send a message to join this chat
fr: Envoyez un premier message pour rejoindre le canal

# userPageLevel
source: lvl
fr: niv

# userPageVictories
source: victories
fr: victoires

# userPageObjectives
source: Objectives
fr: Objectifs

# userPageToggle
source: Show completed
fr: Afficher complétés

# settingsPageTitle
source: Settings
fr: Paramètres

# settingsPageAvatarTitle
source: Choose your avatar
fr: Choisissez votre avatar

# settingsPageThemeLabel
source: Theme color
fr: Thème de couleur

# settingsPageLight
source: Light
fr: Clair

# settingsPageDark
source: Dark
fr: Sombre

# languageSectionFrench
source: Fran√ßais
fr: Français

# musicSectionLabel
source: Victory music
fr: Musique de victoire:

# settingsPagePassword
source: Change password
fr: Changer le mot de passe

source: Save
fr: Sauvegarder

source: edit
fr: editer

# gamePageObjectives
source: Objectives
fr: Objectifs

# gamePageRack
source: Racks
fr: Chevalets

# gamePageHintTitle
source: Choose a hint to preview
fr: Choisissez un indice à prévisualiser

# gamePageHintFor
source: for
fr: pour

# leaveGameTitle
source: Do you really want to quit?
fr: Voulez-vous vraiment abandonner ?

# leaveGameBody
source: You're score for this game wont be in the rankings.
fr: Vous ne pourrez plus rejoindre la partie en tant que joueur par la suite..

# createGameButton
source: Create game
fr: Créer la partie

# createChatButton
source: New chat
fr: Créer un canal

# backButton
source: Back
fr: Retour

# invalidGame
source: This game mode is invalid, please go back and select another one
fr: Votre mode de jeu est invalide, veuillez revenir en arrière

# serverNotFound
source: Server not available, try again later
fr: Serveur indisponible, veuillez réessayer plus tard

# passwordInput
source: Password
fr: Mot de passe

source: Start
fr: Démarer

# quit
source: Leave
fr: Quitter

source: Delete
fr: Supprimer

source: Yes
fr: Oui

source: No
fr: Non

source: Cancel
fr: Annuler

source: Exchange
fr: Échanger

source: Confirm
fr: Confirmer

# changeButton
source: Challenge
fr: Affronter

source: Join
fr: Joindre

# leaveChannelTitle
source: Leave the chat
fr: Quitter la conversation

# leaveChannelBody
source: Are you sure you want to leave this chat ?
fr: Êtes-vous sûr de vouloir quitter la conversation ?

# leaveChannelTitleCreator
source: Delete the chat
fr: Supprimer la conversation

# leaveChannelBodyCreator
source: Are you sure you want to delete this chat ?
fr: Êtes-vous sûr de vouloir supprimer la conversation ?

# statisticSectionTitle
source: Statistics
fr: Statistique

# statisticSectionOne
source: Played games
fr: Parties jouées

# statisticSectionTwo
source: Won games
fr: Parties gagnées

# statisticSectionThree
source: Average score
fr: Score moyen

# statisticSectionFour
source: Time per game
fr: Temp moyen par parties

# historySectionTitle
source: History
fr: Historiques

# historySectionOne
source: Connections
fr: Connexions

# historySectionTwo
source: Played games
fr: Parties jouées

# accessRequest
source: Access request to this game
fr: Demande d'accès à la partie

# accessMessagePartOne
source: Do you want to accept
fr: Voulez-vous accepter

# accessMessagePartTwo
source: in this game?
fr: dans la salle de jeu?

# createChatTitle
source: Create a new chat
fr: Création d'un canal

# createChatBody
source: Type the name for the chat
fr: Veuillez entrer le nom du canal

# createChatErrorOne
source: This chat name already exists
fr: Un canal a déjà ce nom

# createChatErrorTwo
source: Chat name cant be empty
fr: Le nom ne peut être vide

# createChatErrorThree
source: Chat name cant start with 'room'
fr: Le nom ne peut commencer par 'room'

# endGame
source: Too bad...
fr: Dommage...

# endGameText
source: Good game! Unfortunately, the winner is
fr: Très belle partie! Malheureusement, la victoire revient à

# endGameObserver
source: The game has ended
fr: La partie est terminée

# endGameObserverText
source: The winner is
fr: Le gagnant est
